### Terraform plan for prod
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.azurerm_client_config.current: Reading...
azurerm_resource_group.instance: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNWMyYTYyNy05NTRiLTQ2MmEtYWI1NC04ZDM3N2RkZDNlMDM7b2JqZWN0SWQ9MWZjNWI5ZTgtZDljMy00MTc5LThiNmItNDkxZjE4MDFlMDFhO3N1YnNjcmlwdGlvbklkPWM1N2MyYTAyLTI5N2QtNGY2OC05NzliLTE5NjBkZjcyMjYyNzt0ZW5hbnRJZD1lNjdjMTU4OS00NzQ3LTRiNzMtYjdiYi1kYTFiNTY3ZWUxZjU=]
azurerm_windows_web_app.api: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api]
azurerm_service_plan.windows: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverFarms/onlinestore-plan-windows]
azurerm_windows_web_app.website: Refreshing state... [id=/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_container_app.api will be created
  + resource "azurerm_container_app" "api" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "onlinestore-api"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "onlinestore-prod-rg"
      + revision_mode                 = "Single"

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "http"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = (known after apply)
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/azuredocs/containerapps-helloworld:latest"
              + memory            = "0.5Gi"
              + name              = "onlinestore-api"
            }
        }
    }

  # azurerm_container_app_environment.apps will be created
  + resource "azurerm_container_app_environment" "apps" {
      + custom_domain_verification_id      = (known after apply)
      + default_domain                     = (known after apply)
      + docker_bridge_cidr                 = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_resource_group_name = (known after apply)
      + internal_load_balancer_enabled     = false
      + location                           = "eastus"
      + mutual_tls_enabled                 = false
      + name                               = "onlinestore-containerapps"
      + platform_reserved_cidr             = (known after apply)
      + platform_reserved_dns_ip_address   = (known after apply)
      + resource_group_name                = "onlinestore-prod-rg"
      + static_ip_address                  = (known after apply)
      + zone_redundancy_enabled            = false
    }

  # azurerm_container_group.monitoring[0] will be created
  + resource "azurerm_container_group" "monitoring" {
      + dns_name_label              = "onlinestore-prod-monitoring"
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "eastus"
      + name                        = "onlinestore-containergroup-monitoring"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "onlinestore-prod-rg"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + tags                        = {
          + "environment" = "prod"
        }

      + container {
          + commands              = (known after apply)
          + cpu                   = 0.05
          + environment_variables = {
              + "COLLECTOR_OTLP_ENABLED"     = "true"
              + "COLLECTOR_ZIPKIN_HOST_PORT" = ":9411"
            }
          + image                 = "onlinestorecontainerregistry.azurecr.io/jaegertracing/all-in-one:1.42"
          + memory                = 0.2
          + name                  = "jaegertracing-all-in-one"

          + ports {
              + port     = 16686
              + protocol = "TCP"
            }
          + ports {
              + port     = 4317
              + protocol = "TCP"
            }
        }

      + image_registry_credential {
          + password = (sensitive value)
          + server   = "onlinestorecontainerregistry.azurecr.io"
          + username = (sensitive value)
        }
    }

  # azurerm_windows_web_app.api will be destroyed
  # (because azurerm_windows_web_app.api is not in configuration)
  - resource "azurerm_windows_web_app" "api" {
      - app_settings                                   = {} -> null
      - client_affinity_enabled                        = false -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Required" -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - default_hostname                               = "os-onlinestore-prod-api.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - https_only                                     = false -> null
      - id                                             = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-api" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "app" -> null
      - location                                       = "eastus" -> null
      - name                                           = "os-onlinestore-prod-api" -> null
      - outbound_ip_address_list                       = [
          - "52.146.86.197",
          - "52.146.86.203",
          - "52.146.86.217",
          - "52.146.86.220",
          - "52.146.86.235",
          - "52.146.86.242",
          - "20.119.0.26",
        ] -> null
      - outbound_ip_addresses                          = "52.146.86.197,52.146.86.203,52.146.86.217,52.146.86.220,52.146.86.235,52.146.86.242,20.119.0.26" -> null
      - possible_outbound_ip_address_list              = [
          - "52.146.86.197",
          - "52.146.86.203",
          - "52.146.86.217",
          - "52.146.86.220",
          - "52.146.86.235",
          - "52.146.86.242",
          - "52.146.86.252",
          - "52.146.87.56",
          - "52.146.87.63",
          - "52.146.87.67",
          - "52.146.87.121",
          - "52.146.87.130",
          - "52.146.87.137",
          - "52.146.87.149",
          - "52.146.86.175",
          - "52.146.87.151",
          - "52.146.87.154",
          - "52.146.85.93",
          - "52.146.87.208",
          - "52.146.87.214",
          - "52.146.87.219",
          - "52.146.87.223",
          - "52.146.87.245",
          - "52.146.87.252",
          - "20.62.224.12",
          - "20.62.224.64",
          - "20.62.224.67",
          - "20.62.224.68",
          - "20.62.224.77",
          - "20.62.224.80",
          - "20.119.0.26",
        ] -> null
      - possible_outbound_ip_addresses                 = "52.146.86.197,52.146.86.203,52.146.86.217,52.146.86.220,52.146.86.235,52.146.86.242,52.146.86.252,52.146.87.56,52.146.87.63,52.146.87.67,52.146.87.121,52.146.87.130,52.146.87.137,52.146.87.149,52.146.86.175,52.146.87.151,52.146.87.154,52.146.85.93,52.146.87.208,52.146.87.214,52.146.87.219,52.146.87.223,52.146.87.245,52.146.87.252,20.62.224.12,20.62.224.64,20.62.224.67,20.62.224.68,20.62.224.77,20.62.224.80,20.119.0.26" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "onlinestore-prod-rg" -> null
      - service_plan_id                                = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/serverFarms/onlinestore-plan-windows" -> null
      - site_credential                                = (sensitive value) -> null
      - tags                                           = {} -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (4 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "35570f87-d8fc-427a-ac03-d44ccc048815" -> null
          - tenant_id    = "e67c1589-4747-4b73-b7bb-da1b567ee1f5" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                                     = false -> null
          - auto_heal_enabled                             = false -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "index.html",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - ftps_state                                    = "Disabled" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - local_mysql_enabled                           = false -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - remote_debugging_enabled                      = false -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "None" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = true -> null
          - vnet_route_all_enabled                        = false -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (10 unchanged attributes hidden)

          - application_stack {
              - current_stack                = "dotnet" -> null
              - dotnet_version               = "v7.0" -> null
              - java_embedded_server_enabled = false -> null
              - php_version                  = "5.6" -> null
              - python                       = false -> null
                # (14 unchanged attributes hidden)
            }

          - virtual_application {
              - physical_path = "site\\wwwroot" -> null
              - preload       = false -> null
              - virtual_path  = "/" -> null
            }
        }
    }

  # azurerm_windows_web_app.website will be updated in-place
  ~ resource "azurerm_windows_web_app" "website" {
        id                                             = "/subscriptions/c57c2a02-297d-4f68-979b-1960df722627/resourceGroups/onlinestore-prod-rg/providers/Microsoft.Web/sites/os-onlinestore-prod-website"
        name                                           = "os-onlinestore-prod-website"
        tags                                           = {}
        # (25 unchanged attributes hidden)

      ~ site_config {
          + ip_restriction_default_action                 = "Allow"
          + scm_ip_restriction_default_action             = "Allow"
            # (28 unchanged attributes hidden)

          ~ application_stack {
              ~ dotnet_version               = "v7.0" -> "v8.0"
                # (18 unchanged attributes hidden)
            }

          - virtual_application {
              - physical_path = "site\\wwwroot" -> null
              - preload       = false -> null
              - virtual_path  = "/" -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  + container_app_api_fqdn             = (known after apply)
  + container_instance_monitoring_fqdn = (known after apply)
  + resource_group_name                = "onlinestore-prod-rg"
  - web_app_api_hostname               = "os-onlinestore-prod-api.azurewebsites.net" -> null
  - web_app_api_name                   = "os-onlinestore-prod-api" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @benchiverton, Action: `pull_request`, Working Directory: ``, Workflow: `Instance - plan prod`*